
DataStore_CurrenciesDB = {
	["profileKeys"] = {
		["Jhfjhef - La Croisade écarlate"] = "Jhfjhef - La Croisade écarlate",
		["Jy - La Croisade écarlate"] = "Jy - La Croisade écarlate",
		["Nylaria - La Croisade écarlate"] = "Nylaria - La Croisade écarlate",
		["Atec - La Croisade écarlate"] = "Atec - La Croisade écarlate",
		["Hundreth - La Croisade écarlate"] = "Hundreth - La Croisade écarlate",
		["Chimay - La Croisade écarlate"] = "Chimay - La Croisade écarlate",
		["Coven - La Croisade écarlate"] = "Coven - La Croisade écarlate",
		["Carlsberg - La Croisade écarlate"] = "Carlsberg - La Croisade écarlate",
		["Kotlin - La Croisade écarlate"] = "Kotlin - La Croisade écarlate",
		["Îsilia - Kael'thas"] = "Îsilia - Kael'thas",
		["Aldehyde - La Croisade écarlate"] = "Aldehyde - La Croisade écarlate",
		["Kotlin - Ysondre"] = "Kotlin - Ysondre",
		["Srpdgh - La Croisade écarlate"] = "Srpdgh - La Croisade écarlate",
	},
	["global"] = {
		["Reference"] = {
			["Currencies"] = {
				"Anima du réservoir|3528288", -- [1]
				"Cendre d’âme|3743738", -- [2]
				"Rubis infusé|133250", -- [3]
				"Stygie|3743739", -- [4]
				"Bon(s) pour un prix de Sombrelune|134481", -- [5]
				"Insigne distordu dans le temps|463446", -- [6]
				"Honneur|1455894", -- [7]
				"Échos de bataille|1455891", -- [8]
				"Éclat de Néant|132775", -- [9]
				"Essence d’éveil|236521", -- [10]
				"Fragment d’âme rémanente|463284", -- [11]
				"Mana ancestral|1377394", -- [12]
				"Œil clos|801132", -- [13]
				"Pièce curieuse|1604168", -- [14]
				"Ressources de domaine|1397630", -- [15]
				"Sceau du destin brisé|1604167", -- [16]
				"Ressources de fief|1005027", -- [17]
				"Breloque de bonne fortune inférieure|237282", -- [18]
				"Granule de ténèbres|136192", -- [19]
				"Éclat d’esprit|133286", -- [20]
				"Âme rachetée|1391776", -- [21]
				"Points de conquête|1523630", -- [22]
				"Offrande reconnaissante|134344", -- [23]
				"Récompense d’argent|236690", -- [24]
				"Échos de Ny’alotha|3069889", -- [25]
				"Médaille de service de la Brigade de l’Honneur|2565244", -- [26]
				"Perle de mana prismatique|463858", -- [27]
				"Résidu des Titans|2065602", -- [28]
				"Ressources de guerre|2032600", -- [29]
				"Sceau du destin érodé|1416740", -- [30]
				"Souvenirs corrompus|646678", -- [31]
				"Visions coalescentes|1003600", -- [32]
				"Argunite voilée|1064188", -- [33]
				"Fournitures de guerre du Déclin|803763", -- [34]
				"Cristal apogide|1061300", -- [35]
				"Breloque ancienne de bonne fortune|237281", -- [36]
				"Doublon de marin|1604167", -- [37]
				"Fragment d’artéfact|1061303", -- [38]
				"Or des Bastonneurs|237281", -- [39]
				"Marque de Patte de Fer|134912", -- [40]
				"Carburant|1131085", -- [41]
				"Pièce du Temps figé|900319", -- [42]
				"Sceau de guerre|514015", -- [43]
				"Essence d’Aile de mort corrompu|132851", -- [44]
				"Sceau de champion|236246", -- [45]
				"Récompense de l’épicurien|134411", -- [46]
				"Recommandation de Tol Barad|409548", -- [47]
				"Rune du destin mogu|646678", -- [48]
				"Marque de l'Arbre-Monde|513195", -- [49]
			},
			["CurrencyTextRev"] = {
				["Recommandation de Tol Barad"] = 47,
				["Échos de bataille"] = 8,
				["Carburant"] = 41,
				["Éclat d’esprit"] = 20,
				["Fragment d’âme rémanente"] = 11,
				["Mana ancestral"] = 12,
				["Résidu des Titans"] = 28,
				["Récompense d’argent"] = 24,
				["Sceau de guerre"] = 43,
				["Sceau du destin brisé"] = 16,
				["Offrande reconnaissante"] = 23,
				["Cendre d’âme"] = 2,
				["Bon(s) pour un prix de Sombrelune"] = 5,
				["Cristal apogide"] = 35,
				["Stygie"] = 4,
				["Visions coalescentes"] = 32,
				["Ressources de domaine"] = 15,
				["Ressources de fief"] = 17,
				["Pièce du Temps figé"] = 42,
				["Éclat de Néant"] = 9,
				["Rune du destin mogu"] = 48,
				["Sceau de champion"] = 45,
				["Doublon de marin"] = 37,
				["Marque de l'Arbre-Monde"] = 49,
				["Essence d’Aile de mort corrompu"] = 44,
				["Essence d’éveil"] = 10,
				["Rubis infusé"] = 3,
				["Médaille de service de la Brigade de l’Honneur"] = 26,
				["Argunite voilée"] = 33,
				["Marque de Patte de Fer"] = 40,
				["Breloque ancienne de bonne fortune"] = 36,
				["Fragment d’artéfact"] = 38,
				["Fournitures de guerre du Déclin"] = 34,
				["Anima du réservoir"] = 1,
				["Or des Bastonneurs"] = 39,
				["Points de conquête"] = 22,
				["Ressources de guerre"] = 29,
				["Souvenirs corrompus"] = 31,
				["Breloque de bonne fortune inférieure"] = 18,
				["Perle de mana prismatique"] = 27,
				["Granule de ténèbres"] = 19,
				["Âme rachetée"] = 21,
				["Œil clos"] = 13,
				["Honneur"] = 7,
				["Sceau du destin érodé"] = 30,
				["Pièce curieuse"] = 14,
				["Insigne distordu dans le temps"] = 6,
				["Récompense de l’épicurien"] = 46,
				["Échos de Ny’alotha"] = 25,
			},
			["HeadersRev"] = {
				["Donjons & Raids"] = 3,
				["Divers"] = 2,
				["Warlords of Draenor"] = 6,
				["Battle for Azeroth"] = 10,
				["Legion"] = 5,
				["Shadowlands"] = 1,
				["Cataclysm"] = 8,
				["Mists of Pandaria"] = 7,
				["Burning Crusade"] = 9,
				["Wrath of the Lich King"] = 11,
				["JcJ"] = 4,
			},
			["Headers"] = {
				"Shadowlands", -- [1]
				"Divers", -- [2]
				"Donjons & Raids", -- [3]
				"JcJ", -- [4]
				"Legion", -- [5]
				"Warlords of Draenor", -- [6]
				"Mists of Pandaria", -- [7]
				"Cataclysm", -- [8]
				"Burning Crusade", -- [9]
				"Battle for Azeroth", -- [10]
				"Wrath of the Lich King", -- [11]
			},
		},
		["Characters"] = {
			["Default.La Croisade écarlate.Kotlin"] = {
				["Currencies"] = {
					803340417, -- [1]
					137625857, -- [2]
					6032257, -- [3]
					658433, -- [4]
					87687681, -- [5]
					262786, -- [6]
					98304771, -- [7]
					224002948, -- [8]
					67504900, -- [9]
					95685770, -- [10]
					7212298, -- [11]
					3411338, -- [12]
					3594, -- [13]
					129371786, -- [14]
					3850, -- [15]
					89657226, -- [16]
					66326538, -- [17]
					6557829, -- [18]
					1589904517, -- [19]
					177472773, -- [20]
					23728389, -- [21]
					48367109, -- [22]
					1574661, -- [23]
					3901884293, -- [24]
					2053, -- [25]
					10621318, -- [26]
					346687622, -- [27]
					1053191, -- [28]
					22022407, -- [29]
				},
				["Archeology"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					0, -- [4]
					8, -- [5]
					7, -- [6]
					50, -- [7]
					50, -- [8]
					0, -- [9]
					0, -- [10]
					0, -- [11]
					0, -- [12]
					0, -- [13]
					0, -- [14]
					0, -- [15]
					0, -- [16]
					0, -- [17]
					0, -- [18]
					0, -- [19]
					0, -- [20]
				},
				["lastUpdate"] = 1613014871,
				["CurrencyInfo"] = {
					[1828] = "1050-0-0-8000",
					[1885] = "46-0-0-0",
					[1273] = "0-0-0-6",
					[824] = "2645-0-0-10000",
					[1755] = "506-0-0-0",
					[697] = "8-0-0-20",
					[1580] = "0-0-0-5",
					[1767] = "669-0-0-0",
					[738] = "168-0-0-0",
					[823] = "81-0-0-0",
					[1220] = "29769-0-0-0",
					[1275] = "12-0-0-0",
					[1803] = "730-0-0-0",
					[515] = "2-0-0-0",
					[1533] = "1354-0-0-0",
					[1155] = "369-0-0-1200",
					[1342] = "181-0-0-1000",
					[1560] = "987-0-0-0",
					[1716] = "55-0-0-0",
					[1810] = "83-0-0-100",
					[1718] = "0-0-0-0",
					[1719] = "684-0-0-0",
					[1813] = "6129-0-0-35000",
					[1721] = "26-0-0-0",
					[1226] = "12130-0-0-0",
					[1754] = "5-0-0-0",
					[1166] = "750-0-0-0",
					[1508] = "50-0-0-2000",
					[1602] = "515-0-0-5500",
					[1792] = "1709-0-0-15000",
				},
			},
			["Default.La Croisade écarlate.Aldehyde"] = {
				["Currencies"] = {
					267146, -- [1]
					136194, -- [2]
					57672451, -- [3]
					5244037, -- [4]
					596772741, -- [5]
					285742214, -- [6]
					285610374, -- [7]
					206702726, -- [8]
					26085639, -- [9]
					1043600647, -- [10]
					2233735, -- [11]
					267784, -- [12]
					3410312, -- [13]
					398987, -- [14]
					526857, -- [15]
				},
				["Archeology"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					0, -- [4]
					0, -- [5]
					25, -- [6]
					0, -- [7]
					5, -- [8]
					0, -- [9]
					0, -- [10]
					0, -- [11]
					0, -- [12]
					15, -- [13]
					0, -- [14]
					51, -- [15]
					9, -- [16]
					9, -- [17]
					41, -- [18]
					0, -- [19]
					58, -- [20]
				},
				["lastUpdate"] = 1611974457,
				["CurrencyInfo"] = {
					[1299] = "2-0-0-5000",
					[1220] = "4553-0-0-0",
					[824] = "1577-0-0-10000",
					[614] = "26-0-0-0",
					[738] = "199-0-0-0",
					[1101] = "2180-0-0-100000",
					[402] = "1-0-0-0",
					[1166] = "440-0-0-0",
					[776] = "17-0-0-20",
					[823] = "2179-0-0-0",
					[1226] = "40-0-0-0",
					[615] = "2-0-0-0",
					[241] = "3-0-0-0",
					[777] = "7962-0-0-0",
					[1704] = "4-0-0-200",
				},
			},
			["Default.La Croisade écarlate.Jhfjhef"] = {
				["lastUpdate"] = 1611860372,
			},
			["Default.La Croisade écarlate.Nylaria"] = {
				["Currencies"] = {
					395446149, -- [1]
					115345542, -- [2]
					133641, -- [3]
				},
				["lastUpdate"] = 1610779399,
				["CurrencyInfo"] = {
					[824] = "880-0-0-10000",
					[1220] = "3017-0-0-0",
					[1704] = "1-0-0-200",
				},
			},
			["Default.La Croisade écarlate.Atec"] = {
				["Currencies"] = {
					70779137, -- [1]
					4325761, -- [2]
					35258881, -- [3]
					2753154, -- [4]
					113378051, -- [5]
					50201476, -- [6]
					16780036, -- [7]
					1311749, -- [8]
					164496517, -- [9]
					6817029, -- [10]
					1836421, -- [11]
					17434117, -- [12]
					226756229, -- [13]
					1181445, -- [14]
					469895045, -- [15]
					2053, -- [16]
					149293190, -- [17]
					133383, -- [18]
					788872, -- [19]
				},
				["Archeology"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					0, -- [4]
					0, -- [5]
					0, -- [6]
					0, -- [7]
					0, -- [8]
					0, -- [9]
					0, -- [10]
					0, -- [11]
					0, -- [12]
					0, -- [13]
					0, -- [14]
					0, -- [15]
					0, -- [16]
					0, -- [17]
					0, -- [18]
					0, -- [19]
					0, -- [20]
				},
				["lastUpdate"] = 1612241345,
				["CurrencyInfo"] = {
					[1820] = "33-0-0-100",
					[1356] = "10-0-0-0",
					[1792] = "383-0-0-15000",
					[1828] = "540-0-0-8000",
					[1767] = "269-0-0-0",
					[1149] = "1730-0-0-5000",
					[1275] = "9-0-0-0",
					[515] = "21-0-0-0",
					[1155] = "133-0-0-2000",
					[1220] = "3585-0-0-0",
					[1314] = "14-0-20-40",
					[1273] = "0-0-0-6",
					[1533] = "52-0-0-0",
					[1813] = "0-0-0-35000",
					[614] = "6-0-0-0",
					[1226] = "1255-0-0-0",
					[738] = "1-0-0-0",
					[1166] = "865-0-0-0",
					[824] = "1139-0-0-10000",
					[1602] = "128-0-0-4400",
					[1810] = "5-0-0-100",
				},
			},
			["Default.La Croisade écarlate.Chimay"] = {
				["Currencies"] = {
					1446538, -- [1]
					55840394, -- [2]
					3850, -- [3]
					2820, -- [4]
					82707589, -- [5]
					54658309, -- [6]
					4357, -- [7]
					32769541, -- [8]
					132869, -- [9]
					1383991173, -- [10]
					9701510, -- [11]
				},
				["Archeology"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					0, -- [4]
					0, -- [5]
					0, -- [6]
					0, -- [7]
					0, -- [8]
					0, -- [9]
					0, -- [10]
					0, -- [11]
					0, -- [12]
					0, -- [13]
					0, -- [14]
					0, -- [15]
					0, -- [16]
					0, -- [17]
					0, -- [18]
					0, -- [19]
					0, -- [20]
				},
				["lastUpdate"] = 1612800682,
				["CurrencyInfo"] = {
					[1602] = "0-0-0-4950",
					[1580] = "0-0-0-5",
					[824] = "74-0-0-10000",
					[1220] = "10559-0-0-0",
					[1533] = "417-0-0-0",
					[1342] = "0-0-0-1000",
					[1226] = "631-0-0-0",
					[1560] = "426-0-0-0",
					[1275] = "1-0-0-0",
					[1710] = "11-0-0-0",
					[1155] = "250-0-0-300",
				},
			},
			["Default.Kael'thas.Îsilia"] = {
				["Currencies"] = {
					1708938, -- [1]
					5122, -- [2]
					792452, -- [3]
					267915, -- [4]
				},
				["lastUpdate"] = 1612776520,
				["CurrencyInfo"] = {
					[1299] = "13-0-0-5000",
					[402] = "0-0-0-0",
					[391] = "6-0-0-0",
					[241] = "2-0-0-0",
				},
			},
			["Default.La Croisade écarlate.Hundreth"] = {
				["Currencies"] = {
					2622725, -- [1]
					606865285, -- [2]
					39323782, -- [3]
				},
				["lastUpdate"] = 1611973332,
				["CurrencyInfo"] = {
					[1533] = "20-0-0-0",
					[1220] = "4630-0-0-0",
					[824] = "300-0-0-10000",
				},
			},
			["Default.La Croisade écarlate.Coven"] = {
				["Currencies"] = {
					228332426, -- [1]
					3408514, -- [2]
					660482, -- [3]
					5890, -- [4]
					12452611, -- [5]
					20191108, -- [6]
					36045957, -- [7]
					3278085, -- [8]
					2756869, -- [9]
					1312133, -- [10]
					80086533, -- [11]
					24381061, -- [12]
					1574661, -- [13]
					265947013, -- [14]
					264197, -- [15]
					26740870, -- [16]
					7604487, -- [17]
					14816519, -- [18]
					6151, -- [19]
					7346312, -- [20]
				},
				["lastUpdate"] = 1611463053,
				["CurrencyInfo"] = {
					[402] = "5-0-0-0",
					[1299] = "1742-0-0-5000",
					[1149] = "186-0-0-5000",
					[777] = "113-0-0-0",
					[1275] = "12-0-0-0",
					[515] = "26-0-0-0",
					[1155] = "611-0-0-1700",
					[1342] = "21-0-0-1000",
					[1220] = "2029-0-0-0",
					[391] = "154-0-0-0",
					[1314] = "10-0-20-40",
					[1533] = "25-0-0-0",
					[752] = "0-0-0-20",
					[1166] = "95-0-0-0",
					[1226] = "275-0-0-0",
					[738] = "58-0-0-0",
					[416] = "56-0-0-0",
					[1273] = "2-0-0-6",
					[81] = "0-0-0-0",
					[824] = "204-0-0-10000",
				},
			},
			["Default.La Croisade écarlate.Jy"] = {
				["lastUpdate"] = 1612801993,
				["Archeology"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					0, -- [4]
					0, -- [5]
					0, -- [6]
					0, -- [7]
					0, -- [8]
					0, -- [9]
					0, -- [10]
					0, -- [11]
					0, -- [12]
					0, -- [13]
					0, -- [14]
					0, -- [15]
					0, -- [16]
					0, -- [17]
					0, -- [18]
					0, -- [19]
					0, -- [20]
				},
				["Currencies"] = {
					26215557, -- [1]
					3281157, -- [2]
					23594629, -- [3]
					311953285, -- [4]
					20054916, -- [5]
					326109318, -- [6]
				},
				["CurrencyInfo"] = {
					[1149] = "180-0-0-5000",
					[1342] = "25-0-0-1000",
					[1220] = "2380-0-0-0",
					[1792] = "153-0-0-15000",
					[1226] = "200-0-0-0",
					[824] = "2488-0-0-10000",
				},
			},
			["Default.Ysondre.Kotlin"] = {
				["Currencies"] = {
					156504970, -- [1]
					49152771, -- [2]
					53219461, -- [3]
					1029, -- [4]
					799016069, -- [5]
					29099269, -- [6]
					7082245, -- [7]
					8259077, -- [8]
					26609285, -- [9]
					1050373, -- [10]
					302909317, -- [11]
					2053, -- [12]
					201590918, -- [13]
					526599, -- [14]
					657800, -- [15]
				},
				["lastUpdate"] = 1612776328,
				["CurrencyInfo"] = {
					[1299] = "1194-0-0-5000",
					[1220] = "2311-0-0-0",
					[614] = "5-0-0-0",
					[1273] = "0-0-0-6",
					[738] = "4-0-0-0",
					[1356] = "0-0-0-0",
					[1149] = "203-0-0-5000",
					[1166] = "375-0-0-0",
					[1533] = "222-0-0-0",
					[1342] = "54-0-0-1000",
					[1226] = "6096-0-0-0",
					[1155] = "63-0-0-300",
					[1275] = "8-0-0-0",
					[1508] = "406-0-0-2000",
					[824] = "1538-0-0-10000",
				},
			},
			["Default.La Croisade écarlate.Carlsberg"] = {
				["Currencies"] = {
					19926154, -- [1]
					265610, -- [2]
					3594, -- [3]
					76418698, -- [4]
					3850, -- [5]
					6950794, -- [6]
					4208070666, -- [7]
					2820, -- [8]
					174457989, -- [9]
					8783109, -- [10]
					656901, -- [11]
					263941, -- [12]
					5116294, -- [13]
					4870, -- [14]
					395527, -- [15]
				},
				["Archeology"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					0, -- [4]
					0, -- [5]
					0, -- [6]
					0, -- [7]
					0, -- [8]
					0, -- [9]
					0, -- [10]
					0, -- [11]
					0, -- [12]
					0, -- [13]
					0, -- [14]
					0, -- [15]
					0, -- [16]
					0, -- [17]
					0, -- [18]
					0, -- [19]
					0, -- [20]
				},
				["lastUpdate"] = 1612775883,
				["CurrencyInfo"] = {
					[1602] = "0-0-0-4950",
					[1580] = "0-0-0-5",
					[1719] = "53-0-0-0",
					[1560] = "583-0-0-0",
					[738] = "3-0-0-0",
					[1755] = "32105-0-0-0",
					[1721] = "2-0-0-0",
					[1275] = "2-0-0-0",
					[1803] = "152-0-0-0",
					[823] = "39-0-0-0",
					[1226] = "1331-0-0-0",
					[1155] = "5-0-0-300",
					[1533] = "67-0-0-0",
					[1718] = "0-0-0-0",
					[944] = "0-0-0-1000",
				},
			},
			["Default.La Croisade écarlate.Srpdgh"] = {
				["lastUpdate"] = 1611860751,
			},
		},
	},
}
